---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ImageFailures
source: html/9a835d26-ace2-a6f3-49a3-8553d3b57f62.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImageFailures

Failures about Image.

## Syntax (C#)
```csharp
public static class ImageFailures
```